MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GM710/mcu.h
#define _RPOR7_RP56R2_POSITION                   0x00000002
#define _RPOR7_RP56R2_MASK                       0x00000004
#define _RPOR7_RP56R2_LENGTH                     0x00000001

#define _RPOR7_RP56R3_POSITION                   0x00000003
#define _RPOR7_RP56R3_MASK                       0x00000008
#define _RPOR7_RP56R3_LENGTH                     0x00000001

#define _RPOR7_RP56R4_POSITION                   0x00000004
#define _RPOR7_RP56R4_MASK                       0x00000010
#define _RPOR7_RP56R4_LENGTH                     0x00000001

#define _RPOR7_RP56R5_POSITION                   0x00000005
#define _RPOR7_RP56R5_MASK                       0x00000020
#define _RPOR7_RP56R5_LENGTH                     0x00000001

#define _RPOR7_RP57R0_POSITION                   0x00000008
#define _RPOR7_RP57R0_MASK                       0x00000100
#define _RPOR7_RP57R0_LENGTH                     0x00000001

#define _RPOR7_RP57R1_POSITION                   0x00000009
#define _RPOR7_RP57R1_MASK                       0x00000200
#define _RPOR7_RP57R1_LENGTH                     0x00000001

#define _RPOR7_RP57R2_POSITION                   0x0000000A
#define _RPOR7_RP57R2_MASK                       0x00000400
#define _RPOR7_RP57R2_LENGTH                     0x00000001

#define _RPOR7_RP57R3_POSITION                   0x0000000B
#define _RPOR7_RP57R3_MASK                       0x00000800
#define _RPOR7_RP57R3_LENGTH                     0x00000001

#define _RPOR7_RP57R4_POSITION                   0x0000000C
#define _RPOR7_RP57R4_MASK                       0x00001000
#define _RPOR7_RP57R4_LENGTH                     0x00000001

#define _RPOR7_RP57R5_POSITION                   0x0000000D
#define _RPOR7_RP57R5_MASK                       0x00002000
#define _RPOR7_RP57R5_LENGTH                     0x00000001

#define _RPOR8_RP69R_POSITION                    0x00000000
#define _RPOR8_RP69R_MASK                        0x0000003F
#define _RPOR8_RP69R_LENGTH                      0x00000006

#define _RPOR8_RP70R_POSITION                    0x00000008
#define _RPOR8_RP70R_MASK                        0x00003F00
#define _RPOR8_RP70R_LENGTH                      0x00000006

#define _RPOR8_RP69R0_POSITION                   0x00000000
#define _RPOR8_RP69R0_MASK                       0x00000001
#define _RPOR8_RP69R0_LENGTH                     0x00000001

#define _RPOR8_RP69R1_POSITION                   0x00000001
#define _RPOR8_RP69R1_MASK                       0x00000002
#define _RPOR8_RP69R1_LENGTH                     0x00000001

#define _RPOR8_RP69R2_POSITION                   0x00000002
#define _RPOR8_RP69R2_MASK                       0x00000004
#define _RPOR8_RP69R2_LENGTH                     0x00000001

#define _RPOR8_RP69R3_POSITION                   0x00000003
#define _RPOR8_RP69R3_MASK                       0x00000008
#define _RPOR8_RP69R3_LENGTH                     0x00000001

#define _RPOR8_RP69R4_POSITION                   0x00000004
#define _RPOR8_RP69R4_MASK                       0x00000010
#define _RPOR8_RP69R4_LENGTH                     0x00000001

#define _RPOR8_RP69R5_POSITION                   0x00000005
#define _RPOR8_RP69R5_MASK                       0x00000020
#define _RPOR8_RP69R5_LENGTH                     0x00000001

#define _RPOR8_RP70R0_POSITION                   0x00000008
#define _RPOR8_RP70R0_MASK                       0x00000100
#define _RPOR8_RP70R0_LENGTH                     0x00000001

#define _RPOR8_RP70R1_POSITION                   0x00000009
#define _RPOR8_RP70R1_MASK                       0x00000200
#define _RPOR8_RP70R1_LENGTH                     0x00000001

#define _RPOR8_RP70R2_POSITION                   0x0000000A
#define _RPOR8_RP70R2_MASK                       0x00000400
#define _RPOR8_RP70R2_LENGTH                     0x00000001

#define _RPOR8_RP70R3_POSITION                   0x0000000B
#define _RPOR8_RP70R3_MASK                       0x00000800
#define _RPOR8_RP70R3_LENGTH                     0x00000001

#define _RPOR8_RP70R4_POSITION                   0x0000000C
#define _RPOR8_RP70R4_MASK                       0x00001000
#define _RPOR8_RP70R4_LENGTH                     0x00000001

#define _RPOR8_RP70R5_POSITION                   0x0000000D
#define _RPOR8_RP70R5_MASK                       0x00002000
#define _RPOR8_RP70R5_LENGTH                     0x00000001

#define _RPOR9_RP81R_POSITION                    0x00000000
#define _RPOR9_RP81R_MASK                        0x0000003F
#define _RPOR9_RP81R_LENGTH                      0x00000006

#define _RPOR9_RP97R_POSITION                    0x00000008
#define _RPOR9_RP97R_MASK                        0x00003F00
#define _RPOR9_RP97R_LENGTH                      0x00000006

#define _RPOR9_RP81R0_POSITION                   0x00000000
#define _RPOR9_RP81R0_MASK                       0x00000001
#define _RPOR9_RP81R0_LENGTH                     0x00000001

#define _RPOR9_RP81R1_POSITION                   0x00000001
#define _RPOR9_RP81R1_MASK                       0x00000002
#define _RPOR9_RP81R1_LENGTH                     0x00000001

#define _RPOR9_RP81R2_POSITION                   0x00000002
#define _RPOR9_RP81R2_MASK                       0x00000004
#define _RPOR9_RP81R2_LENGTH                     0x00000001

#define _RPOR9_RP81R3_POSITION                   0x00000003
#define _RPOR9_RP81R3_MASK                       0x00000008
#define _RPOR9_RP81R3_LENGTH                     0x00000001

#define _RPOR9_RP81R4_POSITION                   0x00000004
#define _RPOR9_RP81R4_MASK                       0x00000010
#define _RPOR9_RP81R4_LENGTH                     0x00000001

#define _RPOR9_RP81R5_POSITION                   0x00000005
#define _RPOR9_RP81R5_MASK                       0x00000020
#define _RPOR9_RP81R5_LENGTH                     0x00000001

#define _RPOR9_RP97R0_POSITION                   0x00000008
#define _RPOR9_RP97R0_MASK                       0x00000100
#define _RPOR9_RP97R0_LENGTH                     0x00000001

#define _RPOR9_RP97R1_POSITION                   0x00000009
#define _RPOR9_RP97R1_MASK                       0x00000200
#define _RPOR9_RP97R1_LENGTH                     0x00000001

#define _RPOR9_RP97R2_POSITION                   0x0000000A
#define _RPOR9_RP97R2_MASK                       0x00000400
#define _RPOR9_RP97R2_LENGTH                     0x00000001

#define _RPOR9_RP97R3_POSITION                   0x0000000B
#define _RPOR9_RP97R3_MASK                       0x00000800
#define _RPOR9_RP97R3_LENGTH                     0x00000001

#define _RPOR9_RP97R4_POSITION                   0x0000000C
#define _RPOR9_RP97R4_MASK                       0x00001000
#define _RPOR9_RP97R4_LENGTH                     0x00000001

#define _RPOR9_RP97R5_POSITION                   0x0000000D
#define _RPOR9_RP97R5_MASK                       0x00002000
#define _RPOR9_RP97R5_LENGTH                     0x00000001

#define _RPOR10_RP113R_POSITION                  0x00000000
#define _RPOR10_RP113R_MASK                      0x0000003F
#define _RPOR10_RP113R_LENGTH                    0x00000006

#define _RPOR10_RP118R_POSITION                  0x00000008
#define _RPOR10_RP118R_MASK                      0x00003F00
#define _RPOR10_RP118R_LENGTH                    0x00000006

#define _RPOR10_RP113R0_POSITION                 0x00000000
#define _RPOR10_RP113R0_MASK                     0x00000001
#define _RPOR10_RP113R0_LENGTH                   0x00000001

#define _RPOR10_RP113R1_POSITION                 0x00000001
#define _RPOR10_RP113R1_MASK                     0x00000002
#define _RPOR10_RP113R1_LENGTH                   0x00000001

#define _RPOR10_RP113R2_POSITION                 0x00000002
#define _RPOR10_RP113R2_MASK                     0x00000004
#define _RPOR10_RP113R2_LENGTH                   0x00000001

