MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GM710/mcu.h
#define _CM5MSKCON_ACNEN_POSITION                0x00000004
#define _CM5MSKCON_ACNEN_MASK                    0x00000010
#define _CM5MSKCON_ACNEN_LENGTH                  0x00000001

#define _CM5MSKCON_ACEN_POSITION                 0x00000005
#define _CM5MSKCON_ACEN_MASK                     0x00000020
#define _CM5MSKCON_ACEN_LENGTH                   0x00000001

#define _CM5MSKCON_PAGS_POSITION                 0x00000006
#define _CM5MSKCON_PAGS_MASK                     0x00000040
#define _CM5MSKCON_PAGS_LENGTH                   0x00000001

#define _CM5MSKCON_NAGS_POSITION                 0x00000007
#define _CM5MSKCON_NAGS_MASK                     0x00000080
#define _CM5MSKCON_NAGS_LENGTH                   0x00000001

#define _CM5MSKCON_OANEN_POSITION                0x00000008
#define _CM5MSKCON_OANEN_MASK                    0x00000100
#define _CM5MSKCON_OANEN_LENGTH                  0x00000001

#define _CM5MSKCON_OAEN_POSITION                 0x00000009
#define _CM5MSKCON_OAEN_MASK                     0x00000200
#define _CM5MSKCON_OAEN_LENGTH                   0x00000001

#define _CM5MSKCON_OBNEN_POSITION                0x0000000A
#define _CM5MSKCON_OBNEN_MASK                    0x00000400
#define _CM5MSKCON_OBNEN_LENGTH                  0x00000001

#define _CM5MSKCON_OBEN_POSITION                 0x0000000B
#define _CM5MSKCON_OBEN_MASK                     0x00000800
#define _CM5MSKCON_OBEN_LENGTH                   0x00000001

#define _CM5MSKCON_OCNEN_POSITION                0x0000000C
#define _CM5MSKCON_OCNEN_MASK                    0x00001000
#define _CM5MSKCON_OCNEN_LENGTH                  0x00000001

#define _CM5MSKCON_OCEN_POSITION                 0x0000000D
#define _CM5MSKCON_OCEN_MASK                     0x00002000
#define _CM5MSKCON_OCEN_LENGTH                   0x00000001

#define _CM5MSKCON_HLMS_POSITION                 0x0000000F
#define _CM5MSKCON_HLMS_MASK                     0x00008000
#define _CM5MSKCON_HLMS_LENGTH                   0x00000001

#define _CM5FLTR_CFDIV_POSITION                  0x00000000
#define _CM5FLTR_CFDIV_MASK                      0x00000007
#define _CM5FLTR_CFDIV_LENGTH                    0x00000003

#define _CM5FLTR_CFLTREN_POSITION                0x00000003
#define _CM5FLTR_CFLTREN_MASK                    0x00000008
#define _CM5FLTR_CFLTREN_LENGTH                  0x00000001

#define _CM5FLTR_CFSEL_POSITION                  0x00000004
#define _CM5FLTR_CFSEL_MASK                      0x00000070
#define _CM5FLTR_CFSEL_LENGTH                    0x00000003

#define _CM5FLTR_CFDIV0_POSITION                 0x00000000
#define _CM5FLTR_CFDIV0_MASK                     0x00000001
#define _CM5FLTR_CFDIV0_LENGTH                   0x00000001

#define _CM5FLTR_CFDIV1_POSITION                 0x00000001
#define _CM5FLTR_CFDIV1_MASK                     0x00000002
#define _CM5FLTR_CFDIV1_LENGTH                   0x00000001

#define _CM5FLTR_CFDIV2_POSITION                 0x00000002
#define _CM5FLTR_CFDIV2_MASK                     0x00000004
#define _CM5FLTR_CFDIV2_LENGTH                   0x00000001

#define _CM5FLTR_CFSEL0_POSITION                 0x00000004
#define _CM5FLTR_CFSEL0_MASK                     0x00000010
#define _CM5FLTR_CFSEL0_LENGTH                   0x00000001

#define _CM5FLTR_CFSEL1_POSITION                 0x00000005
#define _CM5FLTR_CFSEL1_MASK                     0x00000020
#define _CM5FLTR_CFSEL1_LENGTH                   0x00000001

#define _CM5FLTR_CFSEL2_POSITION                 0x00000006
#define _CM5FLTR_CFSEL2_MASK                     0x00000040
#define _CM5FLTR_CFSEL2_LENGTH                   0x00000001

#define _CVR2CON_CVR_POSITION                    0x00000000
#define _CVR2CON_CVR_MASK                        0x0000000F
#define _CVR2CON_CVR_LENGTH                      0x00000004

#define _CVR2CON_CVRSS_POSITION                  0x00000004
#define _CVR2CON_CVRSS_MASK                      0x00000010
#define _CVR2CON_CVRSS_LENGTH                    0x00000001

#define _CVR2CON_CVRR0_POSITION                  0x00000005
#define _CVR2CON_CVRR0_MASK                      0x00000020
#define _CVR2CON_CVRR0_LENGTH                    0x00000001

#define _CVR2CON_CVROE_POSITION                  0x00000006
#define _CVR2CON_CVROE_MASK                      0x00000040
#define _CVR2CON_CVROE_LENGTH                    0x00000001

#define _CVR2CON_CVREN_POSITION                  0x00000007
#define _CVR2CON_CVREN_MASK                      0x00000080
#define _CVR2CON_CVREN_LENGTH                    0x00000001

#define _CVR2CON_VREFSEL_POSITION                0x0000000A
#define _CVR2CON_VREFSEL_MASK                    0x00000400
#define _CVR2CON_VREFSEL_LENGTH                  0x00000001

#define _CVR2CON_CVRR1_POSITION                  0x0000000B
#define _CVR2CON_CVRR1_MASK                      0x00000800
#define _CVR2CON_CVRR1_LENGTH                    0x00000001

#define _PTGCST_PTGITM_POSITION                  0x00000000
#define _PTGCST_PTGITM_MASK                      0x00000003
#define _PTGCST_PTGITM_LENGTH                    0x00000002

#define _PTGCST_PTGWTO_POSITION                  0x00000006
#define _PTGCST_PTGWTO_MASK                      0x00000040
#define _PTGCST_PTGWTO_LENGTH                    0x00000001

#define _PTGCST_PTGSTRT_POSITION                 0x00000007
#define _PTGCST_PTGSTRT_MASK                     0x00000080
#define _PTGCST_PTGSTRT_LENGTH                   0x00000001

#define _PTGCST_PTGIVIS_POSITION                 0x00000008
#define _PTGCST_PTGIVIS_MASK                     0x00000100
#define _PTGCST_PTGIVIS_LENGTH                   0x00000001

#define _PTGCST_PTGSSEN_POSITION                 0x00000009
#define _PTGCST_PTGSSEN_MASK                     0x00000200
#define _PTGCST_PTGSSEN_LENGTH                   0x00000001

#define _PTGCST_PTGSWT_POSITION                  0x0000000A
#define _PTGCST_PTGSWT_MASK                      0x00000400
#define _PTGCST_PTGSWT_LENGTH                    0x00000001

#define _PTGCST_PTGTOGL_POSITION                 0x0000000C
#define _PTGCST_PTGTOGL_MASK                     0x00001000
#define _PTGCST_PTGTOGL_LENGTH                   0x00000001

#define _PTGCST_PTGSIDL_POSITION                 0x0000000D
#define _PTGCST_PTGSIDL_MASK                     0x00002000
#define _PTGCST_PTGSIDL_LENGTH                   0x00000001

#define _PTGCST_PTGEN_POSITION                   0x0000000F
#define _PTGCST_PTGEN_MASK                       0x00008000
#define _PTGCST_PTGEN_LENGTH                     0x00000001

#define _PTGCON_PTGWDT_POSITION                  0x00000000
#define _PTGCON_PTGWDT_MASK                      0x00000007
#define _PTGCON_PTGWDT_LENGTH                    0x00000003

